# Core tools
brew "chezmoi"
brew "gh"
brew "ghq"
brew "fzf"
brew "direnv"
brew "zoxide"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"

# 1Password CLI
brew "1password-cli"

# macOS apps
if OS.mac?
  cask "1password"
  cask "ghostty"
  cask "warp"
  cask "visual-studio-code"
end
